alhenriqx/esp32CamProject/CamWebServer2/CameraWebServer/app_httpd.cpp
#if CONFIG_ESP_FACE_RECOGNITION_ENABLED
static int run_face_recognition(fb_data_t *fb, std::list<dl::detect::result_t> *results)
{
    std::vector<int> landmarks = results->front().keypoint;
    int id = -1;

    Tensor<uint8_t> tensor;
    tensor.set_element((uint8_t *)fb->data).set_shape({fb->height, fb->width, 3}).set_auto_free(false);

    int enrolled_count = recognizer.get_enrolled_id_num();

    if (enrolled_count < FACE_ID_SAVE_NUMBER && is_enrolling){
        id = recognizer.enroll_id(tensor, landmarks, "", true);
        ESP_LOGI(TAG, "Enrolled ID: %d", id);
        rgb_printf(fb, FACE_COLOR_CYAN, "ID[%u]", id);
    }

    face_info_t recognize = recognizer.recognize(tensor, landmarks);
    if(recognize.id >= 0){
        rgb_printf(fb, FACE_COLOR_GREEN, "ID[%u]: %.2f", recognize.id, recognize.similarity);
    } else {
        rgb_print(fb, FACE_COLOR_RED, "Intruder Alert!");
    }
    return recognize.id;
}
#endif
#endif

#ifdef CONFIG_LED_ILLUMINATOR_ENABLED
void enable_led(bool en)
{ // Turn LED On or Off
    int duty = en ? led_duty : 0;
    if (en && isStreaming && (led_duty > CONFIG_LED_MAX_INTENSITY))
    {
        duty = CONFIG_LED_MAX_INTENSITY;
    }
    ledc_set_duty(CONFIG_LED_LEDC_SPEED_MODE, CONFIG_LED_LEDC_CHANNEL, duty);
    ledc_update_duty(CONFIG_LED_LEDC_SPEED_MODE, CONFIG_LED_LEDC_CHANNEL);
    ESP_LOGI(TAG, "Set LED intensity to %d", duty);
}
#endif

static esp_err_t bmp_handler(httpd_req_t *req)
{
    camera_fb_t *fb = NULL;
    esp_err_t res = ESP_OK;
#if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_INFO
    uint64_t fr_start = esp_timer_get_time();
#endif
    fb = esp_camera_fb_get();
    if (!fb)
    {
        ESP_LOGE(TAG, "Camera capture failed");
        httpd_resp_send_500(req);
        return ESP_FAIL;
    }

    httpd_resp_set_type(req, "image/x-windows-bmp");
    httpd_resp_set_hdr(req, "Content-Disposition", "inline; filename=capture.bmp");
    httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");

    char ts[32];
    snprintf(ts, 32, "%ld.%06ld", fb->timestamp.tv_sec, fb->timestamp.tv_usec);
    httpd_resp_set_hdr(req, "X-Timestamp", (const char *)ts);


    uint8_t * buf = NULL;
    size_t buf_len = 0;
    bool converted = frame2bmp(fb, &buf, &buf_len);
    esp_camera_fb_return(fb);
    if(!converted){
        ESP_LOGE(TAG, "BMP Conversion failed");
        httpd_resp_send_500(req);
        return ESP_FAIL;
    }
    res = httpd_resp_send(req, (const char *)buf, buf_len);
    free(buf);
#if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_INFO
    uint64_t fr_end = esp_timer_get_time();
#endif
    ESP_LOGI(TAG, "BMP: %llums, %uB", (uint64_t)((fr_end - fr_start) / 1000), buf_len);
    return res;
}

static size_t jpg_encode_stream(void *arg, size_t index, const void *data, size_t len)
{
    jpg_chunking_t *j = (jpg_chunking_t *)arg;
    if (!index)
    {
        j->len = 0;
    }
    if (httpd_resp_send_chunk(j->req, (const char *)data, len) != ESP_OK)
    {
        return 0;
    }
    j->len += len;
    return len;
}

//-------------------------------------------------------
// file jpeg chunk encoder
//-------------------------------------------------------
static size_t jpg_encode_file_stream(void *arg, size_t index, const void* pdata, size_t len)
{
  fs::FS &fs = SD_MMC;

  Serial.printf("jpg_encode_file_stream is called\n\r");

  if (!snapShotEnabled && currentStatus == END)
  {
    Serial.printf("terminating jpg_encode_file_stream\n");
    return 0;
  }

  pic_arg_t* pInfo = (pic_arg_t *)arg;
  //
  // open file
  //
  Serial.printf("jpg_encode_file_stream opening file %s\n\r", pInfo->fileName);
  File file_jpg = fs.open(pInfo->fileName, FILE_WRITE);

  //
  // seek to end of file
  //
  Serial.printf("jpg_encode_file_stream moving to pos %d\n\r", pInfo->pos);
  file_jpg.seek(pInfo->pos);
  
  //
  // write data and length
  //
  Serial.printf("jpg_encode_file_stream writing %d bytes\n\r", len);
  file_jpg.write((const uint8_t *)pdata, len);

  pInfo->pos += len;

  //
  // close file
  //
  file_jpg.close();

  return len;
}

//-------------------------------------------------------
// fired every 5 sec
//-------------------------------------------------------
void snapshot_timer()
{
    camera_fb_t * fb = NULL;
    esp_err_t res = ESP_OK;

    Serial.printf("Running snapshot_timer\n\r");

    if (currentStatus == END && !snapShotEnabled)
    {
      Serial.printf("terminating snapshot_timer\n");
      return;
    }

    //timerAlarmDisable(g_timer);

    Serial.printf("getting camera image\n\r");
    
    fb = esp_camera_fb_get();

    Serial.printf("called camera to receive data object\n\r");
    if (!fb)
    {
        Serial.println("Camera capture failed");        
        return;
    }

    Serial.printf("Running snapshot_timer\n\r");
    
    //
    // transfer bytes to file.
    //
    int64_t fr_start = esp_timer_get_time();

    pic_arg_t pic_info = {{0}, 0};

    sprintf(pic_info.fileName, "/pics/image%ul.jpg", fr_start);

    Serial.printf("snapshot file name: %s\n\r", pic_info.fileName);

    pic_info.pos = 0;

    if(fb->format == PIXFORMAT_JPEG)
    {
        Serial.println("snapshot_timer - Pixformat_jpeg captured by camera");
        res = jpg_encode_file_stream(&pic_info, 0, (const char *)fb->buf, fb->len) ? ESP_OK: ESP_FAIL;
    }
    else
    {
        Serial.println("snapshot_timer - other foramt captured by camera");
        res = frame2jpg_cb(fb, 80, jpg_encode_file_stream, &pic_info)?ESP_OK:ESP_FAIL;
    }
    
    esp_camera_fb_return(fb);
    Serial.printf("snapshot_timer Exiting\n\r");
 
    return;
}

//-------------------------------------------------------
// start recording
//-------------------------------------------------------
static esp_err_t startrecord_handler(httpd_req_t *req)
{
    //
    // Start an alarm
    //
    Serial.println("startrecord_handler called");
    snapShotEnabled = true;
    currentStatus = RECORDING;
    Serial.println("timer enabled");

    return ESP_OK;
}

//-------------------------------------------------------
// stop recording
//-------------------------------------------------------
static esp_err_t stoprecord_handler(httpd_req_t *req)
{
    Serial.println("timer stopped");
    //timerAlarmDisable(g_timer);
    //digitalWrite(4, LOW);
    snapShotEnabled = false;
    currentStatus = RECORD_END;

    return ESP_OK;
}


//-------------------------------------------------------
// play all pictures
//-------------------------------------------------------
static esp_err_t playback_handler(httpd_req_t *req)
{
    esp_err_t res = ESP_OK;
    //digitalWrite(4, LOW);
    currentStatus = PLAYBACK;
    const char* _STREAM_PART2 = "Content-Type: image/jpeg\r\nContent-Length: %u\r\n\r\n";
    //
    // this will be in a loop
    //
    fs::FS &fs = SD_MMC;

    Serial.printf("play back all files invoked\n\r");

